app/controllers/likes_controller.rb

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT 1  [["id", 65]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 661]]
INSERT INTO "likes" ("status_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status_id", 71], ["user_id", 661], ["created_at", "2016-12-05 11:05:52.097334"], ["updated_at", "2016-12-05 11:05:52.097334"]]
---
	def create
		@status = Status.find(likes_params[:status])
		@user = User.find(likes_params[:user])

		@like = Like.new(:status => @status, :user => @user)
		if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 15]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 15]]
---
	def destroy
		@like = Like.find(params[:id])
		@like.destroy