app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("user_id", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 311], ["title", "Day One Healthy Challenge"], ["content", "Banana Chocolate Smoothie"], ["created_at", "2016-12-05 10:21:14.285521"], ["updated_at", "2016-12-05 10:21:14.285521"]]
---
	def create
		@status = Status.new(status_params)

		if @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT 1  [["id", 346]]
---
	def edit
		@status = Status.find(params[:id])

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT 1  [["id", 364]]
UPDATE "statuses" SET "user_id" = $1, "title" = $2, "content" = $3, "updated_at" = $4 WHERE "statuses"."id" = $5  [["user_id", 364], ["title", "Day One Healthy Challengesss"], ["content", "Banana Chocolate Smoothie"], ["updated_at", "2016-12-05 10:26:38.717768"], ["id", 364]]
---
	def update
		@status = Status.find(params[:id])
		if @status.update_attributes status_params

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT 1  [["id", 411]]
DELETE FROM "statuses" WHERE "statuses"."id" = $1  [["id", 411]]
---
	def destroy
		@status = Status.find(params[:id])
		@status.destroy